{
    "nature": [
        {
            "title": "Failed Harvest",
            "text": "The fields yield little this year. The earth has turned stubborn, and even the priests say the gods have turned their eyes away."
        },
        {
            "title": "Drought",
            "text": "No rain has fallen for many moons. Wells run dry, and cattle collapse in the dust. Farmers whisper that Poseidon is angry."
        },
        {
            "title": "Earthquake",
            "text": "The ground shakes without warning, toppling walls and statues. Some say it is the anger of the earth itself, others that the gods quarrel below."
        },
        {
            "title": "Pestilence of Fields",
            "text": "Locusts descend upon the crops, devouring everything green. Offerings are burned day and night, but the swarm only grows."
        },
        {
            "title": "Flood",
            "text": "Heavy rains have broken the riverbanks. Homes and granaries lie drowned beneath the muddy waters. Fishermen claim the river spirits are restless."
        }
    ],
    "warfare": [
        {
            "title": "Border Raids",
            "text": "Bands of armed men from a rival city cross the border. Villages burn before the army can rally."
        },
        {
            "title": "Rebellion",
            "text": "Discontent stirs within the city. Workers and slaves refuse their duties, claiming the gods favor no longer rests on the rulers."
        },
        {
            "title": "Siege",
            "text": "Enemy banners appear on the horizon. The city gates are sealed, and food begins to run short as the siege tightens."
        },
        {
            "title": "Deserters",
            "text": "Soldiers have begun to slip away from the camp at night. Fear and hunger have done what the enemy could not."
        },
        {
            "title": "Mercenary Betrayal",
            "text": "Hired warriors have turned their spears for better pay. The city’s trust in foreign swords proves costly."
        }
    ],
    "spirit": [
        {
            "title": "Curse of the Dead",
            "text": "Tombs have been disturbed, and the nights grow uneasy. Some say the dead now walk among the living, seeking what was taken from them."
        },
        {
            "title": "Blasphemy",
            "text": "A sacred image has been defiled. The priests warn that unless the statue is cleansed, no offering will reach the gods."
        },
        {
            "title": "Mad Oracle",
            "text": "The city’s oracle speaks only nonsense. Her visions have turned to screams, and pilgrims flee in fear."
        },
        {
            "title": "Divine Silence",
            "text": "The usual omens have ceased—no birds cry, no flames flicker. The priests worry that the gods have withdrawn their favor entirely."
        },
        {
            "title": "False Prophet",
            "text": "A man claims to speak with the voice of Apollo. Crowds gather to hear him, but the temple denounces his words as lies."
        }
    ],
    "commerce": [
        {
            "title": "Market Fire",
            "text": "Flames swept through the market stalls in the night. The air still smells of burnt oil and coin, and trade has halted."
        },
        {
            "title": "Trade Embargo",
            "text": "A neighboring city has closed its ports to your merchants. Goods rot on ships while diplomats argue at the harbor gates."
        },
        {
            "title": "Coin Forgery",
            "text": "Fake silver has appeared in the markets. Trust fades quickly, and honest trade suffers with it."
        },
        {
            "title": "Craftsmen’s Strike",
            "text": "The artisans have laid down their tools, demanding higher pay and better offerings at their guild shrine."
        },
        {
            "title": "Plague of Rats",
            "text": "Warehouses are overrun with vermin. Grain is spoiled, and merchants fear disease spreading through the docks."
        }
    ]
}