{
    "nature": {
        "farmer": [
            {
                "title": "Rain",
                "text": "A farmer kneels before the altar, his hands rough with work. He asks for rain to soften the soil and feed his crops.",
                "reward": ""
            },
            {
                "title": "Good Harvest",
                "text": "A farmer sets a small bundle of wheat before the shrine. He prays for the coming season to be kind and the grain to grow tall.",
                "reward": ""
            },
            {
                "title": "Healthy Livestock",
                "text": "A shepherd bows low. He says the goats have grown sick and asks the gods to spare what remains of his herd.",
                "reward": ""
            }
        ],
        "merchant": [
            {
                "title": "Calm Seas",
                "text": "A merchant offers a small clay vessel of oil. He asks for steady winds and calm waters so his ships may sail safely.",
                "reward": ""
            },
            {
                "title": "Safe Roads",
                "text": "A trader adjusts his cloak nervously. He says bandits stalk the roads and prays for protection on his next journey.",
                "reward": ""
            },
            {
                "title": "Healthy Workers",
                "text": "A shopkeeper bows and prays that his apprentices stay strong through the long summer heat.",
                "reward": ""
            }
        ],
        "nobleman": [
            {
                "title": "Heir’s Health",
                "text": "A nobleman stands tall but speaks softly. His son is sick, and he prays for his recovery before the family line is broken.",
                "reward": ""
            },
            {
                "title": "Estate Prosperity",
                "text": "A noblewoman offers fine wine. She prays that her estate’s fields bear fruit and her servants stay loyal.",
                "reward": ""
            },
            {
                "title": "Long Life",
                "text": "An aging patrician lights incense. He asks the gods for more years to guide his household and see his grandchildren grown.",
                "reward": ""
            }
        ],
        "foreigner": [
            {
                "title": "Acceptance",
                "text": "A traveler bows deeply. He prays that the local gods welcome him, though he is far from home and speaks their names poorly.",
                "reward": ""
            },
            {
                "title": "Fertile Land",
                "text": "A settler from distant shores offers foreign grain. He asks the gods to let it take root in this new soil.",
                "reward": ""
            },
            {
                "title": "Safe Lodging",
                "text": "A foreign craftsman prays for a place to rest and that no sickness find him in a strange land.",
                "reward": ""
            }
        ],
        "beggar": [
            {
                "title": "Daily Bread",
                "text": "A thin man kneels quietly. He asks only that he not go hungry another night.",
                "reward": ""
            },
            {
                "title": "Shelter",
                "text": "A woman with tattered clothes whispers a prayer for a roof to sleep under before the next storm.",
                "reward": ""
            },
            {
                "title": "Kind Weather",
                "text": "An old beggar lifts his face to the sky. He prays that the coming winter be mild on those without homes.",
                "reward": ""
            }
        ],
        "priest": [
            {
                "title": "Purification",
                "text": "A young priest brings a cracked jug of holy water. He prays for strength to cleanse the temple before the next festival.",
                "reward": ""
            },
            {
                "title": "Sacred Spring",
                "text": "An oracle says the sacred well runs low. She prays the gods renew it so the rites may continue.",
                "reward": ""
            },
            {
                "title": "Temple’s Blessing",
                "text": "An old priest bows. He asks for favor on the temple and those who serve within its walls.",
                "reward": ""
            }
        ],
        "soldier": [
            {
                "title": "Healing",
                "text": "A soldier stands with his arm in a sling. He asks the gods to heal his wounds so he may return to duty.",
                "reward": ""
            },
            {
                "title": "Strength",
                "text": "A hoplite with bandaged legs prays quietly for renewed strength and clear sight for the next march.",
                "reward": ""
            },
            {
                "title": "Safe Return",
                "text": "A young guard bows and asks to come home alive once his watch along the border ends.",
                "reward": ""
            }
        ],
        "artist": [
            {
                "title": "Inspiration",
                "text": "A playwright speaks humbly. He says his thoughts have grown dull and asks for the Muses to stir his mind again.",
                "reward": ""
            },
            {
                "title": "Clear Voice",
                "text": "A singer offers a honey cake. She prays her voice holds true for the coming festival performance.",
                "reward": ""
            },
            {
                "title": "Good Audience",
                "text": "An actor bows before the statue. He asks that the crowd listen kindly and the play end with applause.",
                "reward": ""
            }
        ]
    },
    "commerce": {
        "farmer": [
            {
                "title": "Fair Trade",
                "text": "A farmer brings olives and prays that the merchants in town pay an honest price this season.",
                "reward": ""
            },
            {
                "title": "New Tools",
                "text": "A farmer with cracked hands asks for the means to replace his broken plow.",
                "reward": ""
            },
            {
                "title": "Market Luck",
                "text": "A farmer smiles shyly. He prays that his produce finds buyers before it spoils.",
                "reward": ""
            }
        ],
        "merchant": [
            {
                "title": "Prosperity",
                "text": "A merchant sets down a pouch of coins. He asks that his business thrive and his partners deal fairly.",
                "reward": ""
            },
            {
                "title": "Trade Route Safety",
                "text": "A trader prays for safe passage for his caravans through rough mountain roads.",
                "reward": ""
            },
            {
                "title": "Honest Partners",
                "text": "A spice dealer prays that his partners remain true and his name stay clean in the marketplace.",
                "reward": ""
            }
        ],
        "nobleman": [
            {
                "title": "Favor at Court",
                "text": "A nobleman prays to speak wisely at the council and win the ears of those in power.",
                "reward": ""
            },
            {
                "title": "Art Patronage",
                "text": "A noblewoman leaves silver coins. She asks that her commissioned sculptor finish his work with divine inspiration.",
                "reward": ""
            },
            {
                "title": "Estate Wealth",
                "text": "A patrician prays that his lands yield enough to host grand feasts and uphold his family’s name.",
                "reward": ""
            }
        ],
        "foreigner": [
            {
                "title": "Fair Dealings",
                "text": "A trader from distant lands prays that locals treat him fairly in business despite his accent.",
                "reward": ""
            },
            {
                "title": "Cultural Exchange",
                "text": "A scholar from afar prays that his teachings be accepted and understood in this city.",
                "reward": ""
            },
            {
                "title": "Good Reputation",
                "text": "A foreign merchant asks the gods that no lies be spoken about his goods or craft.",
                "reward": ""
            }
        ],
        "beggar": [
            {
                "title": "Work",
                "text": "A poor man prays for someone to offer him honest labor, even if only for a day.",
                "reward": ""
            },
            {
                "title": "Tools",
                "text": "A destitute potter asks for simple tools so he can work again and not beg.",
                "reward": ""
            },
            {
                "title": "Learning",
                "text": "A young beggar prays to be taken as an apprentice in any craft that will keep him fed.",
                "reward": ""
            }
        ],
        "priest": [
            {
                "title": "Festival Order",
                "text": "A temple priest prays that the upcoming festival go smoothly and all offerings be accepted.",
                "reward": ""
            },
            {
                "title": "Donations",
                "text": "A priest asks the gods to move the hearts of citizens to give generously to the temple fund.",
                "reward": ""
            },
            {
                "title": "Craftsmen’s Blessing",
                "text": "An oracle prays that local artisans find skill and harmony in their work for the temple.",
                "reward": ""
            }
        ],
        "soldier": [
            {
                "title": "Smith’s Fire",
                "text": "A soldier brings a dull sword. He prays the city’s smiths work well so blades hold strong.",
                "reward": ""
            },
            {
                "title": "Sturdy Armor",
                "text": "A hoplite kneels, praying for armor that will not fail in battle.",
                "reward": ""
            },
            {
                "title": "Fair Pay",
                "text": "A soldier bows and prays that his wages be paid in full when the campaign ends.",
                "reward": ""
            }
        ],
        "artist": [
            {
                "title": "Inspiration",
                "text": "An artist prays that new ideas come to him before the next festival.",
                "reward": ""
            },
            {
                "title": "Generous Patrons",
                "text": "A poet prays that wealthy citizens notice his talent and commission his work.",
                "reward": ""
            },
            {
                "title": "Skilled Hands",
                "text": "A painter bows and asks for steady hands to complete his mural before the deadline.",
                "reward": ""
            }
        ]
    },
    "warfare": {
        "farmer": [
            {
                "title": "Peaceful Borders",
                "text": "A farmer near the frontier prays that the soldiers keep the enemy far from his fields.",
                "reward": ""
            },
            {
                "title": "Untouched Harvest",
                "text": "A man holding a sickle prays that no army trample his crops this season.",
                "reward": ""
            },
            {
                "title": "Safety of Family",
                "text": "A farmer asks the gods to protect his wife and children if war comes too near.",
                "reward": ""
            }
        ],
        "merchant": [
            {
                "title": "Safe Convoy",
                "text": "A merchant bows. He asks the gods to guard his wagons as they pass through war-torn roads.",
                "reward": ""
            },
            {
                "title": "Loyal Guards",
                "text": "A trader prays his hired guards stand firm if ambushed on the trade route.",
                "reward": ""
            },
            {
                "title": "Market Stability",
                "text": "A merchant prays that war not ruin the markets or drive away his customers.",
                "reward": ""
            }
        ],
        "nobleman": [
            {
                "title": "Victory",
                "text": "A noble general prays that his army prevail and his family’s name be honored in victory.",
                "reward": ""
            },
            {
                "title": "Courage of Men",
                "text": "A commander offers a bronze helm. He asks for bravery among his soldiers when the fighting begins.",
                "reward": ""
            },
            {
                "title": "Strategic Wisdom",
                "text": "A noble prays for a clear mind to outthink his enemies and save his city.",
                "reward": ""
            }
        ],
        "foreigner": [
            {
                "title": "Redemption",
                "text": "A foreign warrior prays for a chance to prove his loyalty after fleeing a lost homeland.",
                "reward": ""
            },
            {
                "title": "Peace Treaty",
                "text": "A diplomat from another city prays that talks go well and bloodshed can be avoided.",
                "reward": ""
            },
            {
                "title": "Survival",
                "text": "A mercenary from afar prays that he live to see another dawn, no matter who wins.",
                "reward": ""
            }
        ],
        "beggar": [
            {
                "title": "For the Fallen",
                "text": "A beggar lays wilted flowers on the steps. He prays that his brother’s spirit find rest.",
                "reward": ""
            },
            {
                "title": "End of War",
                "text": "A poor widow prays that no more sons be taken for fighting.",
                "reward": ""
            },
            {
                "title": "Protection",
                "text": "A beggar from a ruined village asks that the city walls hold strong.",
                "reward": ""
            }
        ],
        "priest": [
            {
                "title": "War Omens",
                "text": "An oracle’s voice shakes. She asks the gods to reveal whether the coming war will favor their city.",
                "reward": ""
            },
            {
                "title": "Blessing of Arms",
                "text": "A priest prays over offerings of iron. He asks the gods to bless every spear and shield.",
                "reward": ""
            },
            {
                "title": "Peaceful End",
                "text": "A temple elder prays that when war ends, mercy follows quickly.",
                "reward": ""
            }
        ],
        "soldier": [
            {
                "title": "Courage",
                "text": "A young soldier prays for the strength not to flee when the horns sound.",
                "reward": ""
            },
            {
                "title": "Victory",
                "text": "A hoplite kneels and asks the gods to let him strike true and stand unharmed.",
                "reward": ""
            },
            {
                "title": "Return Home",
                "text": "A weary veteran prays only to see his family again once the campaign ends.",
                "reward": ""
            }
        ],
        "artist": [
            {
                "title": "Epic Ending",
                "text": "A playwright prays for words to finish his tragedy about the war just fought.",
                "reward": ""
            },
            {
                "title": "War Memorial",
                "text": "A sculptor prays that his monument to the fallen stands tall for generations.",
                "reward": ""
            },
            {
                "title": "Battle Hymn",
                "text": "A musician asks for strength to compose a song that honors both bravery and loss.",
                "reward": ""
            }
        ]
    },
    "spirit": {
        "farmer": [
            {
                "title": "Love’s Return",
                "text": "A farmer prays his wife, gone to her family, will forgive his anger and return home.",
                "reward": ""
            },
            {
                "title": "Peace for Ancestors",
                "text": "A man lights a small fire. He prays that his father’s spirit rest easily beneath the earth.",
                "reward": ""
            },
            {
                "title": "Hope",
                "text": "A farmer bows and asks the gods not to forget the humble, even when the fields are bare.",
                "reward": ""
            }
        ],
        "merchant": [
            {
                "title": "Reconciliation",
                "text": "A merchant prays for peace with his brother after years of bitter dispute over inheritance.",
                "reward": ""
            },
            {
                "title": "Good Marriage",
                "text": "A trader prays that his daughter’s wedding bring happiness and not misfortune.",
                "reward": ""
            },
            {
                "title": "Safe Passage of Soul",
                "text": "A wealthy man prays for his mother’s soul to find her way to the afterlife.",
                "reward": ""
            }
        ],
        "nobleman": [
            {
                "title": "Eternal Name",
                "text": "A nobleman prays that his deeds be remembered long after death.",
                "reward": ""
            },
            {
                "title": "Faithful Love",
                "text": "A widow of noble birth prays that her husband’s spirit watches over her kindly.",
                "reward": ""
            },
            {
                "title": "Ancestral Favor",
                "text": "A noble family offers wine. They pray their ancestors bless their descendants with unity.",
                "reward": ""
            }
        ],
        "foreigner": [
            {
                "title": "Unknown Gods",
                "text": "A traveler prays to any who will listen. He hopes the local gods accept his offering.",
                "reward": ""
            },
            {
                "title": "Memory of Home",
                "text": "A foreigner lights incense for those buried far away, asking that distance not divide their souls.",
                "reward": ""
            },
            {
                "title": "Shared Faith",
                "text": "A traveler prays that the people here understand that all gods hear the same hearts.",
                "reward": ""
            }
        ],
        "beggar": [
            {
                "title": "Mercy",
                "text": "A beggar kneels and whispers, asking the gods for kindness in life or death.",
                "reward": ""
            },
            {
                "title": "Rest for the Lost",
                "text": "A blind beggar prays for those who died forgotten to be remembered once more.",
                "reward": ""
            },
            {
                "title": "Small Joys",
                "text": "A poor woman prays for someone to smile at her in the street, just once more.",
                "reward": ""
            }
        ],
        "priest": [
            {
                "title": "Guidance",
                "text": "An oracle prays that her visions show truth and not the tricks of restless spirits.",
                "reward": ""
            },
            {
                "title": "Rite of Passage",
                "text": "A priest prays that the souls of the newly dead reach the afterlife without delay.",
                "reward": ""
            },
            {
                "title": "Divine Favor",
                "text": "A temple elder prays for a sign that the gods still walk among their people.",
                "reward": ""
            }
        ],
        "soldier": [
            {
                "title": "Fallen Comrade",
                "text": "A soldier lays his helmet down. He prays that his friend’s soul find peace in the afterlife.",
                "reward": ""
            },
            {
                "title": "Redemption",
                "text": "A mercenary prays for forgiveness for the lives he has taken.",
                "reward": ""
            },
            {
                "title": "Homecoming",
                "text": "A soldier prays that when his time comes, his body is returned to his family for proper burial.",
                "reward": ""
            }
        ],
        "artist": [
            {
                "title": "Beloved Muse",
                "text": "A sculptor prays before a statue of his late wife, asking for her guidance in his art.",
                "reward": ""
            },
            {
                "title": "True Love",
                "text": "A young poet prays that his affection be returned and not mocked.",
                "reward": ""
            },
            {
                "title": "Beauty Remembered",
                "text": "An old painter prays that the gods let his work preserve the faces of those he loved.",
                "reward": ""
            }
        ]
    }
}